src/test/resources/org/lockss/ws/status/getAuStatusRequest.xml

<!--
Sample SOAP request for simple testing.

Usage:
  curl -H "content-type: text/xml" -d @path/to/this/file
       http://user:pass@host:port/ws/DaemonStatusService
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:service="http://status.ws.lockss.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <service:getAuStatus>
            <auId>org|lockss|plugin|RegistryPlugin&amp;base_url~http%3A%2F%2Fprops%2Elockss%2Eorg%3A8001%2Fdemo%2Fplugins%2F</auId>
        </service:getAuStatus>
    </soapenv:Body>
</soapenv:Envelope>
